#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.lambda_layers.data.archive_file.layer_archive["utility_zip_file"]: Reading...
module.lambda_layers.data.archive_file.layer_archive["utility_zip_file"]: Read complete after 0s [id=1f54fcb211ef2502758c012188bb9cd8d499b374]
data.aws_route53_zone.domain_zone: Reading...
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_partition.current: Reading...
module.dashboard.data.aws_region.current: Reading...
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_caller_identity.current: Reading...
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_region.current: Reading...
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_partition.current: Read complete after 0s [id=aws]
module.dashboard.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.sns.aws_sns_topic.email_topic: Refreshing state... [id=arn:aws:sns:us-east-1:836049003243:mulla-website-prod-email]
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.acm_certificate.aws_acm_certificate.app: Refreshing state... [id=arn:aws:acm:us-east-1:836049003243:certificate/e5cdfc4e-8321-41d9-968d-813fd8306a21]
module.s3_bucket.aws_s3_bucket.website: Refreshing state... [id=mulla-website-prod]
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_caller_identity.current: Read complete after 0s [id=836049003243]
module.cloudfront_waf.aws_wafv2_web_acl.web_acl: Refreshing state... [id=b5807fb5-5df6-4969-91ba-a56c6e2c478e]
data.aws_route53_zone.domain_zone: Read complete after 0s [id=Z019756110G25DTYU8A62]
module.dns.aws_route53_record.www: Refreshing state... [id=Z019756110G25DTYU8A62_www_CNAME]
module.acm_certificate.aws_route53_record.app["*.mulla.au"]: Refreshing state... [id=Z019756110G25DTYU8A62__59998f89be3aecbef1a8f900beeb9d7d.mulla.au._CNAME]
module.acm_certificate.aws_route53_record.app["mulla.au"]: Refreshing state... [id=Z019756110G25DTYU8A62__59998f89be3aecbef1a8f900beeb9d7d.mulla.au._CNAME]
module.sns.aws_sns_topic_subscription.send_alert_email["alert@mulla.au"]: Refreshing state... [id=arn:aws:sns:us-east-1:836049003243:mulla-website-prod-email:484d13d2-af84-4e06-ba1a-7285aeaa9e8f]
module.alarms.module.all_lambdas_errors_alarm.aws_cloudwatch_metric_alarm.this[0]: Refreshing state... [id=mulla-website-prod-all-lambda-errors]
module.acm_certificate.aws_acm_certificate_validation.app: Refreshing state... [id=2023-11-28 08:10:08.355 +0000 UTC]
module.api.module.api_authorizer.random_password.api_auth_token: Refreshing state... [id=none]
module.api.module.api_authorizer.data.archive_file.lambda_source_package: Reading...
module.api.aws_iam_role.api_role: Refreshing state... [id=mulla-website-prod-api-role]
module.api.module.contact.data.archive_file.lambda_source_package: Reading...
module.api.aws_api_gateway_rest_api.api: Refreshing state... [id=r5j9dfgmj4]
module.api.aws_iam_role.cloudwatch: Refreshing state... [id=mulla-website-prod-api-cloudwatch-role]
module.api.module.api_authorizer.data.archive_file.lambda_source_package: Read complete after 0s [id=8c96bd6554b1db5477d56619c3a6fcc9a8941a16]
module.api.module.contact.data.archive_file.lambda_source_package: Read complete after 0s [id=8138c74d9276518443ade5431aa3b72570054adf]
module.api.module.api_authorizer.aws_ssm_parameter.api_auth_token_ssm: Refreshing state... [id=/mulla-website/prod/api_auth_token]
module.s3_bucket.aws_s3_bucket_ownership_controls.website_ownership_controls: Refreshing state... [id=mulla-website-prod]
module.s3_bucket.aws_s3_bucket_public_access_block.website_block: Refreshing state... [id=mulla-website-prod]
module.s3_bucket.aws_s3_bucket_cors_configuration.cors: Refreshing state... [id=mulla-website-prod]
module.s3_bucket.aws_s3_bucket_versioning.website_versioning: Refreshing state... [id=mulla-website-prod]
module.lambda_layers.aws_s3_object.lambda_code_zip["utility_zip_file"]: Refreshing state... [id=lambda_zip/layer/utility_zip_file]
module.api.module.contact.aws_s3_object.lambda_code_zip: Refreshing state... [id=lambda_zip/function/contact]
module.api.module.api_authorizer.aws_s3_object.lambda_code_zip: Refreshing state... [id=lambda_zip/function/authorizer]
module.api.aws_cloudwatch_log_group.api_gateway_execution_logs: Refreshing state... [id=API-Gateway-Execution-Logs_r5j9dfgmj4/production]
module.api.aws_api_gateway_resource.contact: Refreshing state... [id=7lat7t]
module.s3_bucket.aws_s3_bucket_acl.website_acl: Refreshing state... [id=mulla-website-prod,private]
module.lambda_layers.module.lambda_layer["utility_zip_file"].aws_lambda_layer_version.this[0]: Refreshing state... [id=arn:aws:lambda:us-east-1:836049003243:layer:mulla-website-prod-utility:7]
module.api.module.contact.module.contact_lambda.data.aws_partition.current: Reading...
module.api.module.contact.module.contact_lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.api.module.contact.module.contact_lambda.data.aws_caller_identity.current: Reading...
module.api.module.contact.module.contact_lambda.data.aws_region.current: Reading...
module.api.module.contact.module.contact_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.api.module.contact.module.contact_lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/mulla-website-prod-contact]
module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2576865068]
module.api.module.contact.module.contact_lambda.aws_iam_role.lambda[0]: Refreshing state... [id=mulla-website-prod-contact]
module.api.module.contact.module.contact_lambda.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::836049003243:policy/mulla-website-prod-contact-inline]
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_partition.current: Reading...
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_caller_identity.current: Reading...
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_region.current: Reading...
module.api.module.contact.module.contact_lambda.data.aws_caller_identity.current: Read complete after 0s [id=836049003243]
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.api.aws_api_gateway_account.api_cloudwatch_role: Refreshing state... [id=api-gateway-account]
module.api.aws_iam_role_policy.cloudwatch: Refreshing state... [id=mulla-website-prod-api-cloudwatch-role:mulla-website-prod-cloudwatch-policy]
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_caller_identity.current: Read complete after 0s [id=836049003243]
module.api.module.api_authorizer.module.authorizer_lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/mulla-website-prod-authorizer]
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2256909269]
module.api.module.api_authorizer.module.authorizer_lambda.aws_iam_role.lambda[0]: Refreshing state... [id=mulla-website-prod-authorizer]
module.api.module.api_authorizer.module.authorizer_lambda.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::836049003243:policy/mulla-website-prod-authorizer-inline]
module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.logs[0]: Reading...
module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=779959300]
module.api.module.contact.module.contact_lambda.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::836049003243:policy/mulla-website-prod-contact-logs]
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_iam_policy_document.logs[0]: Reading...
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=623675521]
module.api.module.api_authorizer.module.authorizer_lambda.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::836049003243:policy/mulla-website-prod-authorizer-logs]
module.api.module.contact.module.contact_lambda.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=mulla-website-prod-contact-20231128081033386500000002]
module.api.module.api_authorizer.module.authorizer_lambda.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=mulla-website-prod-authorizer-20231128081033526400000003]
module.api.module.contact.module.contact_lambda.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=mulla-website-prod-contact-20231128081033928600000005]
module.api.module.api_authorizer.module.authorizer_lambda.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=mulla-website-prod-authorizer-20231128081033796900000004]
module.api.module.contact.module.contact_lambda.aws_lambda_function.this[0]: Refreshing state... [id=mulla-website-prod-contact]
module.api.module.api_authorizer.module.authorizer_lambda.aws_lambda_function.this[0]: Refreshing state... [id=mulla-website-prod-authorizer]
module.api.module.contact.aws_lambda_permission.lambda_permession: Refreshing state... [id=AllowAPIGatewayInvoke]
module.api.aws_iam_role_policy.authorizer_invocation_policy: Refreshing state... [id=mulla-website-prod-api-role:mulla-website_prod-authorizer-invocation]
module.api.module.api_authorizer.aws_api_gateway_authorizer.lambda_authorizer: Refreshing state... [id=8egyej]
module.api.module.api_authorizer.aws_lambda_permission.lambda_permession: Refreshing state... [id=AllowAPIGatewayInvoke]
module.api.module.contact.aws_api_gateway_method.contact: Refreshing state... [id=agm-r5j9dfgmj4-7lat7t-POST]
module.api.module.contact.aws_api_gateway_integration.contact_lambda_integration: Refreshing state... [id=agi-r5j9dfgmj4-7lat7t-POST]
module.api.aws_api_gateway_deployment.api_deploy: Refreshing state... [id=8duc9l]
module.api.aws_api_gateway_stage.apigw_stage: Refreshing state... [id=ags-r5j9dfgmj4-prod]
module.api.aws_api_gateway_method_settings.apigw_setting: Refreshing state... [id=r5j9dfgmj4-prod-*/*]
module.cdn.aws_cloudfront_function.remove_path: Refreshing state... [id=mulla-website-prod-remove-path]
module.cdn.aws_cloudfront_origin_access_control.default: Refreshing state... [id=E3S9YPMCWNG973]
module.cdn.aws_cloudfront_origin_request_policy.api_origin_request_policy: Refreshing state... [id=35ab741d-85e0-4bed-ac25-c85736d8f216]
module.cdn.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E31O030KNHMSZL]
module.website.data.aws_caller_identity.current: Reading...
module.dns.aws_route53_record.ipv4: Refreshing state... [id=Z019756110G25DTYU8A62_mulla.au_A]
module.dashboard.aws_cloudwatch_dashboard.monitoring_dashboard: Refreshing state... [id=mulla-website-prod-dashboard]
module.website.data.aws_iam_policy_document.website_policy: Reading...
module.website.aws_s3_bucket_server_side_encryption_configuration.s3_encryption: Refreshing state... [id=mulla-website-prod]
module.website.data.aws_iam_policy_document.website_policy: Read complete after 0s [id=1303545816]
module.website.aws_s3_bucket_policy.access: Refreshing state... [id=mulla-website-prod]
module.website.data.aws_caller_identity.current: Read complete after 0s [id=836049003243]
module.website.aws_s3_object.images["cevo-logo.webp"]: Refreshing state... [id=images/cevo-logo.webp]
module.website.aws_s3_object.images["telstra.webp"]: Refreshing state... [id=images/telstra.webp]
module.website.aws_s3_object.static_files["static/css/main.b8644671.css"]: Refreshing state... [id=website/static/css/main.b8644671.css]
module.website.aws_s3_object.images["rmit.webp"]: Refreshing state... [id=images/rmit.webp]
module.website.aws_s3_object.images["rmit-logo.webp"]: Refreshing state... [id=images/rmit-logo.webp]
module.website.aws_s3_object.images["tarek-mulla.webp"]: Refreshing state... [id=images/tarek-mulla.webp]
module.website.aws_s3_object.images["rmit-online-logo.webp"]: Refreshing state... [id=images/rmit-online-logo.webp]
module.website.aws_s3_object.images["compuleader-logo.webp"]: Refreshing state... [id=images/compuleader-logo.webp]
module.website.aws_s3_object.images["portfolio.webp"]: Refreshing state... [id=images/portfolio.webp]
module.website.aws_s3_object.images["tishreen-university-logo.webp"]: Refreshing state... [id=images/tishreen-university-logo.webp]
module.website.aws_s3_object.images["tbb.webp"]: Refreshing state... [id=images/tbb.webp]
module.website.aws_s3_object.images["iress.webp"]: Refreshing state... [id=images/iress.webp]
module.website.aws_s3_object.images["ciandt-logo.webp"]: Refreshing state... [id=images/ciandt-logo.webp]
module.website.aws_s3_object.images["banner.webp"]: Refreshing state... [id=images/banner.webp]
module.website.aws_s3_object.images["ehealth.webp"]: Refreshing state... [id=images/ehealth.webp]
module.website.aws_s3_object.images["iress-logo.webp"]: Refreshing state... [id=images/iress-logo.webp]
module.website.aws_s3_object.static_files["sitemap.xml"]: Refreshing state... [id=website/sitemap.xml]
module.website.aws_s3_object.static_files["static/js/main.4e580500.js.map"]: Refreshing state... [id=website/static/js/main.4e580500.js.map]
module.website.aws_s3_object.static_files["robots.txt"]: Refreshing state... [id=website/robots.txt]
module.website.aws_s3_object.static_files["asset-manifest.json"]: Refreshing state... [id=website/asset-manifest.json]
module.website.aws_s3_object.static_files["static/js/main.4e580500.js.LICENSE.txt"]: Refreshing state... [id=website/static/js/main.4e580500.js.LICENSE.txt]
module.website.aws_s3_object.static_files["static/js/496.182f416c.chunk.js"]: Refreshing state... [id=website/static/js/496.182f416c.chunk.js]
module.website.aws_s3_object.static_files["static/js/496.182f416c.chunk.js.map"]: Refreshing state... [id=website/static/js/496.182f416c.chunk.js.map]
module.website.aws_s3_object.static_files["static/css/main.b8644671.css.map"]: Refreshing state... [id=website/static/css/main.b8644671.css.map]
module.website.aws_s3_object.static_files["favicon.ico"]: Refreshing state... [id=website/favicon.ico]
module.website.aws_s3_object.static_files["index.html"]: Refreshing state... [id=website/index.html]
module.website.aws_s3_object.static_files["static/js/main.4e580500.js"]: Refreshing state... [id=website/static/js/main.4e580500.js]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.website.aws_s3_object.images["deakin-logo.webp"] will be created
  + resource "aws_s3_object" "images" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "mulla-website-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/webp"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/deakin-logo.webp"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/images/deakin-logo.webp"
      + source_hash            = "4c6f8198d2594ac30723afa3a4403508"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.images["tarek-mulla.webp"] will be updated in-place
  ~ resource "aws_s3_object" "images" {
        id                            = "images/tarek-mulla.webp"
      ~ source_hash                   = "abc64d2180f706625af9fe63b86cbb5e" -> "e1191d7ecdd24f16cc6faeb32ab4ce7b"
        tags                          = {}
      ~ version_id                    = "QOuqUiABJeaImX2.9taIORg1G9ySLnjP" -> (known after apply)
        # (24 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.static_files["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
        id                            = "website/asset-manifest.json"
      ~ source_hash                   = "d688271f6258b3d912dff588971772e8" -> "fd705d293f5304e66e619ecb36a4df47"
        tags                          = {}
      ~ version_id                    = "i1W_7Sf8Bs4rPXEnWr.SWpfIchpimEAs" -> (known after apply)
        # (24 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.static_files["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
        id                            = "website/index.html"
      ~ source_hash                   = "1df674ba5f9c733ecb88943ed873a70d" -> "fedacb582753d2a6fd9458c72ac25687"
        tags                          = {}
      ~ version_id                    = "G..aLjnDno6lhN8V1r7sN4Ujzp4WhWEb" -> (known after apply)
        # (24 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.static_files["static/js/main.4e580500.js"] will be destroyed
  # (because key ["static/js/main.4e580500.js"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - arn                           = "arn:aws:s3:::mulla-website-prod/website/static/js/main.4e580500.js" -> null
      - bucket                        = "mulla-website-prod" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/javascript" -> null
      - etag                          = "903671067ec2971a109d9b799f6b0ab8" -> null
      - force_destroy                 = false -> null
      - id                            = "website/static/js/main.4e580500.js" -> null
      - key                           = "website/static/js/main.4e580500.js" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "../webapp/build/static/js/main.4e580500.js" -> null
      - source_hash                   = "903671067ec2971a109d9b799f6b0ab8" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
      - version_id                    = "YOSCQNmi36X5jor7hWH2F.NwdvpwRw6i" -> null
        # (12 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.static_files["static/js/main.4e580500.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/main.4e580500.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - arn                           = "arn:aws:s3:::mulla-website-prod/website/static/js/main.4e580500.js.LICENSE.txt" -> null
      - bucket                        = "mulla-website-prod" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "text/plain; charset=utf-8" -> null
      - etag                          = "ad574122e8d86a1666a1ca6da504d7a4" -> null
      - force_destroy                 = false -> null
      - id                            = "website/static/js/main.4e580500.js.LICENSE.txt" -> null
      - key                           = "website/static/js/main.4e580500.js.LICENSE.txt" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "../webapp/build/static/js/main.4e580500.js.LICENSE.txt" -> null
      - source_hash                   = "ad574122e8d86a1666a1ca6da504d7a4" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
      - version_id                    = "tm8iL_QfJjvm.yf9sPnybgpoTB8I697X" -> null
        # (12 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.static_files["static/js/main.4e580500.js.map"] will be destroyed
  # (because key ["static/js/main.4e580500.js.map"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - arn                           = "arn:aws:s3:::mulla-website-prod/website/static/js/main.4e580500.js.map" -> null
      - bucket                        = "mulla-website-prod" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/octet-stream" -> null
      - etag                          = "c9b0f69a8f005daede98e563c63c3338" -> null
      - force_destroy                 = false -> null
      - id                            = "website/static/js/main.4e580500.js.map" -> null
      - key                           = "website/static/js/main.4e580500.js.map" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "../webapp/build/static/js/main.4e580500.js.map" -> null
      - source_hash                   = "c9b0f69a8f005daede98e563c63c3338" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
      - version_id                    = "WdbxqDVKA7C0r22hzXPC7CsWsYVvttm7" -> null
        # (12 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.static_files["static/js/main.98896253.js"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "mulla-website-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/static/js/main.98896253.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/main.98896253.js"
      + source_hash            = "e8a965ee4c4c056d48199dba74e0b0f7"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["static/js/main.98896253.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "mulla-website-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/static/js/main.98896253.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/main.98896253.js.LICENSE.txt"
      + source_hash            = "ad574122e8d86a1666a1ca6da504d7a4"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["static/js/main.98896253.js.map"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "mulla-website-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/static/js/main.98896253.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/main.98896253.js.map"
      + source_hash            = "1d9e21844b59c45169039b79d83d2add"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 4 to add, 3 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @tarekmulla, Action: `pull_request`, Workflow: `Terraform Plan`*